app/views/share/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
<h1><%= link_to current_user.name, current_user %></h1>
<span><%= current_user.microposts.count %>条微博</span>