app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "11"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["activated", 1], ["activated_at", "2019-12-24 12:11:23.146623"], ["id", 1]]
---
  def edit
    user = User.find_by(email: params[:email])
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_columns(activated: true, activated_at: Time.now)