app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def home
    if logged_in?
      @micropost = current_user.microposts.build
      @feed_items = current_user.feed#.paginate(page: params[:page])